const obj = {
  quizzesName: 'Тестовый квиз c массиовм ответов и описанием',
  category: 'JS',
  difficultyLevel: 5,
  questions: [
    {
      э: 'Тут будет текст вопроса',
      answerOptions: [
        'useEffect(() => { ... })',
        'useEffect(() => { return () => { ... } }, [dependencies])',
        'useEffect(() => { return () => { ... } })',
        "const foo = () => 'hello, world'",
        "const foo = () => 'hello, world'",
      ],
      correctAnswer: [1, 2, 3],
      description:
        'Описание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответа',
    },
    {
      question: 'Тут будет текст вопроса',
      answerOptions: [
        'useEffect(() => { ... })',
        'useEffect(() => { return () => { ... } }, [dependencies])',
        'useEffect(() => { return () => { ... } })',
        "const foo = () => 'hello, world'",
        "const foo = () => 'hello, world'",
      ],
      correctAnswer: [2, 3, 4],
      description:
        'Описание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответа',
    },
    {
      question: 'Тут будет текст вопроса',
      answerOptions: [
        'NaN + NaN',
        'typeof null',
        'typeof function',
        '{}.push()',
        'const arr = []',
      ],
      correctAnswer: [1, 2, 3],
      description:
        'Описание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответа',
    },
    {
      question: 'Тут будет текст вопроса',
      answerOptions: [
        'function test(){ return {} + []}',
        'function test(){ return [] + []}',
        'new Map()',
        'new Set()',
        'Class myFavoriteClass',
      ],
      correctAnswer: [0],
      description:
        'Описание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответа',
    },
    {
      question: 'Тут будет текст вопроса',
      answerOptions: [
        'const a = 5; const b = 6; a ?? b',
        "setTimeout(() => console.log(';zopa'), 1000)",
        "setInterval(() => console.log('zopa'), 1000)",
        "var aboba = 'aboba'",
        'Object.prototype, __proto___',
      ],
      correctAnswer: [2, 4],
      description:
        'Описание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответаОписание правильного ответа',
    },
  ],
};
